perf-tests/results_v3_20260421_095020/spring/hey_customers_50k.txt

Summary:
  Total:	7.3377 secs
  Slowest:	0.9897 secs
  Fastest:	0.0003 secs
  Average:	0.0722 secs
  Requests/sec:	6814.1405
  

Response time histogram:
  0.000 [1]	|
  0.099 [46721]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.198 [2295]	|■■
  0.297 [427]	|
  0.396 [53]	|
  0.495 [6]	|
  0.594 [0]	|
  0.693 [0]	|
  0.792 [0]	|
  0.891 [21]	|
  0.990 [476]	|


Latency distribution:
  10%% in 0.0370 secs
  25%% in 0.0502 secs
  50%% in 0.0591 secs
  75%% in 0.0731 secs
  90%% in 0.0903 secs
  95%% in 0.1085 secs
  99%% in 0.4034 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.2280 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0101 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0091 secs
  resp wait:	0.0704 secs, 0.0002 secs, 0.9897 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0045 secs

Status code distribution:
  [200]	50000 responses