perf-tests/results_v3_20260421_095020/spring/vegeta_accounts_1k.txt
Requests      [total, rate, throughput]         30000, 1000.03, 1000.02
Duration      [total, attack, wait]             29.999s, 29.999s, 362.375µs
Latencies     [min, mean, 50, 90, 95, 99, max]  208.792µs, 68.089ms, 268.775µs, 319.723ms, 595.749ms, 807.595ms, 939.262ms
Bytes In      [total, mean]                     5340000, 178.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:30000  
Error Set: